<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta name="description" content="ergolab, ressources ergonomie web et logiciel">
<meta name="keywords" content="ergolab, ressources ergonomie web et logiciel, utilisabilité">
<title>Ergolab - La conception centr&eacute;e utilisateur . version imprimable</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" type="text/css" href="../styles/ie.css">
</head>
<body style="background-color: \#FFFFFF;" bgcolor="#FFFFFF" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<table width="680" border="0" cellspacing="0" cellpadding="0" bgcolor="#FFFFFF">
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620" class="txt"><br>
		<h1 class="t1">La conception centr&eacute;e utilisateur</h1>
		<br>
		<span class="txtgris">(date de r&eacute;daction : 16.05.2004)</span><br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt=""> <b>Sommaire</b><br>
		<br>
		&nbsp;&nbsp;&nbsp;<a href="#1" class="lka">Introduction</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#2" class="lka">1. Le concept</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#3" class="lka">2. La norme ISO 13407</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#4" class="lka">2.1. Nature et objectifs de l'ISO 13407</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#5" class="lka">2.2. Caract&eacute;ristiques du processus de conception centr&eacute;e utilisateur</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#6" class="lka">2.3. Etapes du processus de conception centr&eacute;e utilisateur</a><br>
		&nbsp;&nbsp;&nbsp;<a href="#7" class="lka">Conclusion</a><br>
		&nbsp;&nbsp;&nbsp;<a href="#8" class="lka">Pour en savoir plus...</a><br>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<br>
		<h2 class="t2"><a name="1"></a>Introduction</h2>
		<br>
		<br>
		La conception centr&eacute;e utilisateur consiste &agrave; consid&eacute;rer les utilisateurs et leurs besoins tout au long du processus de d&eacute;veloppement d'une application informatique. Cet article pr&eacute;sente les caract&eacute;ristiques de
		la conception centr&eacute;e utilisateur en s'appuyant sur sa d&eacute;finition dans la norme ISO 13407. Nous &eacute;voquons aussi les principales m&eacute;thodes affect&eacute;es &agrave; chacune des &eacute;tapes du cycle de conception centr&eacute;
		utilisateur. <br>
		<br>
		<br>
		<h2 class="t2"><a name="2"></a>1. Le concept</h2>
		<br>
		<br>
		Les utilisateurs finaux sont les mieux plac&eacute;s pour &eacute;valuer et influencer le d&eacute;veloppement d'un produit. Si le produit final correspond &agrave; leurs besoins, envies et caract&eacute;ristiques, il aura toutes les chances
		d'&ecirc;tre adopt&eacute;. Et c'est bien le but ultime de tout produit. La conception centr&eacute;e utilisateur impose que le d&eacute;veloppement du produit doit &ecirc;tre guid&eacute; par les besoins des utilisateurs plut&ocirc;t que par les
		possibilit&eacute;s technologiques.<br>
		<br>
		Le processus de conception d'une application informatique doit donc mettre en oeuvre des moyens pour adapter le produit &agrave; la cible utilisateur. La conception centr&eacute;e utilisateur (CCU) en tant que processus de d&eacute;veloppement inclut un
		ensemble de m&eacute;thodes sp&eacute;cialis&eacute;es, destin&eacute;es &agrave; recueillir des entr&eacute;es utilisateur et &agrave; les convertir en choix de conception.<br>
		<br>
		Le concept d'utilisateur final r&eacute;f&egrave;re ici &agrave; deux types de r&eacute;f&eacute;rents :<br>
		<br>
		- L'<b>utilisateur final r&eacute;el</b>, c'est &agrave; dire qui utilisera l'application de fa&ccedil;on personnelle ou professionnelle apr&egrave;s son lancement (et &eacute;ventuellement qui utilise d&eacute;j&agrave; une version
		pr&eacute;c&eacute;dente du produit)<br>
		<br>
		- L'<b>utilisateur final potentiel</b>, qui pr&eacute;sente les m&ecirc;mes caract&eacute;ristiques que celles de la cible pr&eacute;vue. On fait donc intervenir des participants repr&eacute;sentatifs d'un type sp&eacute;cifique de cible (en termes
		d'&acirc;ge, de culture, d'exp&eacute;rience avec l'outil informatique, d'expertise dans un domaine de connaissance donn&eacute;, d'environnement technologique, etc.).<br>
		<br>
		Le processus de CCU ne se contente pas de demander aux utilisateurs ce qu'ils d&eacute;sirent, mais bien de mettre en oeuvre des m&eacute;thodes rigoureuses de recueil de donn&eacute;es concernant leurs t&acirc;ches, besoins, puis leur satisfaction,
		leur efficacit&eacute; et leur efficience dans l'utilisation d'un produit existant ou d'un prototype.<br>
		<br>
		Cette implication des utilisateurs doit &ecirc;tre &agrave; la fois pr&eacute;coce (elle est n&eacute;cessaire d&egrave;s les pr&eacute;misses du projet) et it&eacute;rative (elle doit se r&eacute;p&eacute;ter tout au long des &eacute;tapes cl&eacute;s
		du projet).<br>
		<br>
		Concevoir une application facile &agrave; utiliser est donc un r&eacute;sultat qui d&eacute;coule de m&eacute;thodologies de conception, et n&eacute;cessite de se demander &agrave; chaque &eacute;tape critique de la conception si le produit correspond
		aux besoins des utilisateurs finaux. Cette approche a &eacute;t&eacute; traduite en une norme internationale, l'ISO 13407 (Processus de conception des syst&egrave;mes interactifs centr&eacute;s sur l'humain).<br>
		<br>
		<br>
		<h2 class="t2"><a name="3"></a>2. La norme ISO 13407</h2>
		<br>
		<br>
		<br>
		<h3 class="t3"><a name="4"></a>2.1. Nature et objectifs de l'ISO 13407</h3>
		<br>
		<br>
		La normalisation dans le domaine de l'ergonomie des interface couvre deux champs distincts : celui des produits et celui des processus. Les normes d&eacute;velopp&eacute;es en mati&egrave;re d'ergonomie informatique ont d'abord &eacute;t&eacute;
		d&eacute;di&eacute;es aux pr&eacute;conisations sur la qualit&eacute; ergonomique finale du produit (cf. norme ISO 9241).<br>
		<br>
		La norme ISO 13407 vise le champ plus large du cycle de conception d'applications informatiques et d&eacute;termine les exigences auxquelles un projet doit r&eacute;pondre pour &ecirc;tre consid&eacute;r&eacute; comme &quot;centr&eacute; sur
		l'humain&quot;. Elle concerne la m&eacute;thodologie de conception et l'int&eacute;gration de la d&eacute;marche ergonomique dans un cycle de d&eacute;veloppement.<br>
		<br>
		Cette norme a &eacute;t&eacute; compl&eacute;t&eacute;e en 2000 du rapport technique 18529, con&ccedil;u sur la base des travaux du projet INUSE (cf. <a href="#8" class="lka">lectures compl&eacute;mentaires</a>). Il d&eacute;crit sept ensembles de
		pratiques de base pour mettre en oeuvre le processus de conception centr&eacute;e sur l'humain. <br>
		<br>
		Un second rapport technique a &eacute;t&eacute; r&eacute;dig&eacute; en 2002 sur proposition du groupe d'experts AFNOR en ergonomie des logiciels. Ce rapport (ISO TR 16982) permet d'identifier quelles m&eacute;thodes d'utilisabilit&eacute; sont
		recommand&eacute;es &agrave; un stade d&eacute;termin&eacute; du cycle de vie, en prenant en consid&eacute;ration les &eacute;l&eacute;ments de d&eacute;cision habituels d'un chef de projet. 12 m&eacute;thodes g&eacute;n&eacute;riques ont
		&eacute;t&eacute; identifi&eacute;es et d&eacute;crites succinctement avec leurs principaux avantages et inconv&eacute;nients selon les caract&eacute;ristiques du projet.<br>
		<br>
		<br>
		<h3 class="t3"><a name="5"></a>2.2. Caract&eacute;ristiques du processus de conception centr&eacute;e utilisateur</h3>
		<br>
		<br>
		La norme ISO 13407 d&eacute;finit les conditions de la mise en oeuvre d'un processus centr&eacute; sur l'op&eacute;rateur humain. 5 principes sont n&eacute;cessaires &agrave; la satisfaction de cette norme :<br>
		<br>
		- <b>Une pr&eacute;occupation amont des utilisateurs</b>, de leurs t&acirc;ches et de leur environnement<br>
		<br>
		- <b>La participation active de ces utilisateurs</b>, ainsi que la compr&eacute;hension claire de leurs besoins et des exigences li&eacute;es &agrave; leurs t&acirc;ches<br>
		<br>
		- <b>Une r&eacute;partition appropri&eacute;e des fonctions</b> entre les utilisateurs et la technologie<br>
		<br>
		- <b>L'it&eacute;ration des solutions de conception</b> : on peut s'imaginer le cycle comme une spirale, une d&eacute;marche qui boucle et reboucle jusqu'&agrave; ce que le syst&egrave;me satisfasse aux exigences d&eacute;finies au d&eacute;part.<br>
		<br>
		- <b>L'intervention d'une &eacute;quipe de conception multi-disciplinaire</b>. La conception centr&eacute;e utilisateur repr&eacute;sente en effet plus que de simples consid&eacute;rations sur l'utilisabilit&eacute;. Son caract&egrave;re global vise une
		exp&eacute;rience utilisateur optimale. Cette notion d'exp&eacute;rience utilisateur est au carrefour de disciplines diff&eacute;rentes (facteurs humains, architecture de l'information, design, marketing, qualit&eacute;, etc.).<br>
		<br>
		<br>
		<h3 class="t3"><a name="6"></a>2.3. Etapes du processus de conception centr&eacute;e utilisateur</h3>
		<br>
		<br>
		Un processus de CCU typique comprend trois phases principales mises en oeuvre de fa&ccedil;on it&eacute;rative : <br>
		<br>
		- ANALYSE<br>
		- CONCEPTION<br>
		- EVALUATION<br>
		<br>
		De fa&ccedil;on plus pr&eacute;cise, l'ISO 13407 d&eacute;finit les &eacute;tapes du cycle de conception centr&eacute;e utilisateur comme suit :<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/cycle_conception13407.gif" border="0" hspace="4" alt=""> <br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		Nous allons d&eacute;tailler ces &eacute;tapes de conception en leur associant les m&eacute;thodes les plus utilis&eacute;es en ergonomie des interfaces.<br>
		<br>
		<br>
		Cette liste n'est d'abord pas exhaustive, mais surtout jamais toutes les m&eacute;thodes ne seront utilis&eacute;es dans un m&ecirc;me projet. Il s'agit seulement ici de lister les possibilit&eacute;s qui s'offrent &agrave; l'&eacute;quipe de conception
		sur le plan m&eacute;thodologique.<br>
		<br>
		L'intervention et les m&eacute;thodes utilis&eacute;es seront adapt&eacute;es en fonction de facteurs vari&eacute;s tels que temps disponible, marges de manœuvre financi&egrave;res, disponibilit&eacute; des utilisateurs ou op&eacute;rateurs, type
		d'application (experte ou grand public), domaine d'intervention (classiquement, logiciel ou Web), et des comp&eacute;tences des intervenants.<br>
		<br>
		De fa&ccedil;on r&eacute;sum&eacute;e, les moyens d'impliquer les utilisateurs passent par des m&eacute;thodes de types entretiens ou questionnaires, observation, focus groups et tests utilisateurs. On peut affecter chacune des m&eacute;thodes &agrave;
		une &eacute;tape particuli&egrave;re du cycle de CCU.<br>
		<br>
		<br>
		<br>
		<h4 class="t4"><img src="../images/puce_rml.gif" align="top" border="0" alt=""> Planifier le processus de conception centr&eacute;e sur l'utilisateur</h4>
		<br>
		<br>
		<br>
		<img src="../download/images/13407_etape1.png" border="0" hspace="4" alt=""> <br>
		<br>
		<br>
		Le pr&eacute;-requis essentiel &agrave; la CCU consiste &agrave; planifier sa mise en oeuvre. L'&eacute;quipe projet doit donc avoir atteint un consensus concernant la recherche de la satisfaction de la norme ISO 13407 et donc de ses implications sur
		les plans techniques, m&eacute;thodologiques, et de conduite de projet.<br>
		<br>
		La n&eacute;cessit&eacute; de se baser sur cette norme pour fonder le projet doit &ecirc;tre expliqu&eacute;e et comprise par les intervenants, qui doivent en saisir l'importance et les enjeux. Les avantages doivent &ecirc;tre connus de l'&eacute;quipe,
		notamment le retour sur investissement, la satisfaction des utilisateurs, l'utilisabilit&eacute; du syst&egrave;me et l'adaptation aux caract&eacute;ristiques des op&eacute;rateurs.<br>
		<br>
		Les exigences doivent aussi &ecirc;tre clairement explicit&eacute;es. On doit &eacute;tudier de quelle mani&egrave;re la CCU peut aider &agrave; atteindre les objectifs organisationnels. On doit de plus choisir le meilleur moyen d'int&eacute;grer les
		exigences de l'ISO 13407 &agrave; un &eacute;ventuel processus de d&eacute;veloppement existant. Cette &eacute;tape consiste aussi &agrave; d&eacute;finir pr&eacute;cis&eacute;ment le type de conception choisie, les m&eacute;thodes centr&eacute;es
		utilisateur qui seront mises en oeuvre, les &eacute;tapes d'implication des utilisateurs... <br>
		<br>
		L'ergonome doit consulter les documents d'entreprise qui pourraient int&eacute;resser le projet et participer &agrave; la collaboration inter-sp&eacute;cialistes autour de discussions, d'&eacute;changes, de r&eacute;unions, de rapports… Dans le cas de
		la conception d'une application m&eacute;tier, on essaie aussi de constituer un groupe de travail (compos&eacute; notamment des op&eacute;rateurs, futurs utilisateurs du syst&egrave;me).<br>
		<br>
		De fa&ccedil;on r&eacute;sum&eacute;e, cette pr&eacute;-&eacute;tape consiste &agrave; planifier les activit&eacute;s de d&eacute;veloppement dans une optique de conception centr&eacute;e utilisateur. <br>
		<br>
		<br>
		<br>
		<h4 class="t4"><img src="../images/puce_rml.gif" align="top" border="0" alt=""> Comprendre et sp&eacute;cifier le contexte d'utilisation</h4>
		<br>
		<br>
		<br>
		<img src="../download/images/13407_etape2.png" border="0" hspace="4" alt=""> <br>
		<br>
		<br>
		La premi&egrave;re &eacute;tape proprement dite du cycle de CCU vise &agrave; comprendre et sp&eacute;cifier le contexte d'utilisation. Il s'agit donc de <b>comprendre la population cible et ses caract&eacute;ristiques, ses buts et t&acirc;ches, ses
		environnements</b>.<br>
		<br>
		A cet effet, il s'agit d'abord de <b>d&eacute;crire les environnements</b> technique, physique, ambiants, social, organisationnel et l&eacute;gislatif. Les contraintes mat&eacute;rielles doivent &ecirc;tre identifi&eacute;es par la connaissance du parc
		informatique (par exemple caract&eacute;ristiques de bande passante ou r&eacute;solutions d'&eacute;cran les plus courantes). On adaptera en effet la conception des dispositifs d'entr&eacute;e et d'affichage en fonction de ces donn&eacute;es.<br>
		<br>
		L’<b>identification des profils utilisateurs</b> est la base essentielle de cette premi&egrave;re &eacute;tape du cycle. La connaissance de ces profils permettra de choisir les m&eacute;thodes d’&eacute;valuation et de s&eacute;lectionner des
		participants pour mener des tests utilisateurs.<br>
		<br>
		L'ergonome doit donc chercher &agrave; identifier les caract&eacute;ristiques des utilisateurs finaux (connaissances, comp&eacute;tences, fonctions, t&acirc;ches &agrave; accomplir, niveau d'exp&eacute;rience m&eacute;tier et d'exp&eacute;rience de
		l'outil informatique, langage, &eacute;ducation, formation, caract&eacute;ristiques physiques, psychologiques, habitudes, aptitudes). <br>
		<br>
		On doit identifier les groupes d'utilisateurs s'il existe des groupes diff&eacute;renci&eacute;s (exemple experts et novices, ou op&eacute;rateurs avec des responsabilit&eacute;s et donc activit&eacute;s et acc&egrave;s &agrave; l'information
		diff&eacute;rents), et d&eacute;tailler leurs caract&eacute;ristiques et besoins respectifs. Il importe en outre de s'interroger sur l’accessibilit&eacute; et les besoins sp&eacute;cifiques des personnes.<br>
		<br>
		<br>
		Des m&eacute;thodes fond&eacute;es sur l'observation et le recours aux questionnaires sont des sources d'information essentielles pour l'ergonome. L'analyse des besoins peut aussi profiter de la m&eacute;thode des groupes de discussion (focus groups
		traditionnels ou &eacute;lectroniques, par exemple sous la forme de forums de discussion). Pour le d&eacute;veloppement de services ne correspondant pas &agrave; des besoins utilisateur identifi&eacute;s, cette m&eacute;thode peut servir &agrave;
		g&eacute;n&eacute;rer des id&eacute;es de fonctionnalit&eacute;s et &agrave; se poser la question de l'utilit&eacute;. Dans le m&ecirc;me ordre d'id&eacute;e, des s&eacute;ances de brainstorming peuvent &ecirc;tre extr&ecirc;mement productives. <br>
		<br>
		Les m&eacute;thodes de benchmarking pour le Web (analyse de sites concurrents), ou de revue de syst&egrave;mes et produits similaires pour les solutions logicielles permettent de conna&icirc;tre l'existant, de se baser sur ces &eacute;l&eacute;ments ou
		d'en extraire des principes n&eacute;gatifs ou positifs.<br>
		<br>
		Pour des projets de refonte, le recueil des donn&eacute;es peut b&eacute;n&eacute;ficier d'une analyse des usages des outils existants. Dans le m&ecirc;me ordre d'id&eacute;e, l'analyse des t&acirc;ches utilisateur permet de comprendre comment les
		utilisateurs vont utiliser le syst&egrave;me, quelles sont les t&acirc;ches critiques, les plus fr&eacute;quentes, leurs importances, dur&eacute;es et niveau de difficult&eacute; respectifs. On essaie de d&eacute;terminer le d&eacute;roulement pas
		&agrave; pas de la compl&eacute;tion des t&acirc;ches et les interd&eacute;pendances. Cette d&eacute;marche s'appuie sur la volont&eacute; de capitaliser sur les connaissances qu’ont d&eacute;j&agrave; les op&eacute;rateurs auxquels s’adresse le
		syst&egrave;me, afin de r&eacute;duire les temps d'apprentissage et d'am&eacute;liorer l'utilisabilit&eacute; de l'outil &agrave; concevoir.<br>
		<br>
		Des entretiens semi-directifs permettent de compl&eacute;ter les donn&eacute;es d'observation que l'on aura recueillies. On doit veiller &agrave; faire valider par les utilisateurs les descriptions de t&acirc;ches obtenues. Les connaissances extraites
		lors de l'analyse de t&acirc;che permettront de d&eacute;gager des mod&egrave;les de t&acirc;che.<br>
		<br>
		Les techniques de tri de carte peuvent &ecirc;tre utilis&eacute;es pour des applications expertes, mais aussi pour des sites Web &agrave; cible plus large. En effet, il permettra de d&eacute;tecter les groupements d'information pertinents pour les
		utilisateurs et aussi les d&eacute;nominations les plus compr&eacute;hensibles (lire l'article <a href="tri-de-cartes-ergonomie-web.html" class="lk1">Tri de cartes et ergonomie web</a>). <br>
		<br>
		Enfin, les approches dans le domaine de l'ethnographie peuvent &ecirc;tre pr&eacute;cieuses pour conna&icirc;tre le contexte utilisateur, de m&ecirc;me que la constitution de matrices fonctionnelles (pour des t&acirc;ches bien d&eacute;finies des
		applications expertes) et les techniques de Cognitive Walkthrough.<br>
		<br>
		Le choix des techniques &agrave; utiliser est fonction du contexte technique (type et caract&eacute;ristiques de l'application, niveau d'abstraction des items), des marges temporelles et financi&egrave;res et aussi de la disponibilit&eacute; des
		utilisateurs. Ces diff&eacute;rentes techniques n&eacute;cessitent en en effet plus ou moins de mat&eacute;riel, de temps et de comp&eacute;tences de la part de l'exp&eacute;rimentateur.<br>
		<br>
		<br>
		<br>
		<h4 class="t4"><img src="../images/puce_rml.gif" align="top" border="0" alt=""> Sp&eacute;cifier les exigences li&eacute;es &agrave; l'utilisateur et &agrave; l'organisation</h4>
		<br>
		<br>
		<br>
		<img src="../download/images/13407_etape3.png" border="0" hspace="4" alt=""> <br>
		<br>
		<br>
		L'&eacute;tape suivante dans le cycle consiste &agrave; sp&eacute;cifier les exigences li&eacute;es &agrave; l'utilisateur et &agrave; l'organisation. Il s'agit de prendre en compte les besoins, comp&eacute;tences et l'environnement de travail de tous
		les intervenants pertinents sur le syst&egrave;me. <br>
		<br>
		L'identification des buts et t&acirc;ches des utilisateurs est la base du travail de sp&eacute;cification des exigences. Cette caract&eacute;risation des t&acirc;ches est document&eacute;e par l'&eacute;tape pr&eacute;c&eacute;dente. Les documents de
		sp&eacute;cifications consistent en des descriptions pr&eacute;cises des profils d'utilisateurs et des cas d'utilisation.<br>
		<br>
		On utilise ces connaissances pour extraire des exigences pr&eacute;cises concernant l'assistance du syst&egrave;me &agrave; l'ex&eacute;cution des t&acirc;ches et les objectifs que les utilisateurs pourront atteindre en se servant de l'outil. Ces <b>objectifs
		d'utilisabilit&eacute;</b> doivent &ecirc;tre pr&eacute;cis et r&eacute;pondre &agrave; la question : &quot;<i>Qu’est-ce que je vais mesurer et qu’est-ce que j’attends en termes de performance homme-machine?</i>&quot;.<br>
		<br>
		Les objectifs sont d&eacute;termin&eacute;s du point de vue qualitatif et quantitatif. On peut fixer des exigences &agrave; atteindre concernant les crit&egrave;res suivants :<br>
		<br>
		- Taux de succ&egrave;s<br>
		- Nombre d'erreurs<br>
		- Temps d'ex&eacute;cution des t&acirc;ches<br>
		- Nombre d'&eacute;tapes n&eacute;cessaires &agrave; la compl&eacute;tion des t&acirc;ches<br>
		- Eventuels recours &agrave; une aide interne ou externe au produit<br>
		- Rythme d'apprentissage<br>
		- Satisfaction des utilisateurs…<br>
		<br>
		Les exigences doivent ensuite &ecirc;tre ordonn&eacute;es selon leur importance. A ce niveau, les objectifs d'utilisabilit&eacute; vont guider et justifier les choix de conception. Ils fourniront par la suite des crit&egrave;res d’acceptation lors des
		tests utilisateurs. <br>
		<br>
		On doit d&eacute;finir un mod&egrave;le conceptuel de l'outil, une repr&eacute;sentation des t&acirc;ches qu'il doit supporter et des r&eacute;sultats qu'il doit permettre d'atteindre en termes d'efficacit&eacute;, d'efficience, et de satisfaction des
		utilisateurs. <br>
		<br>
		<br>
		Les objectifs sp&eacute;cifi&eacute;s lors de cette &eacute;tape ne sont pas seulement des objectifs li&eacute;s &agrave; la qualit&eacute; d'utilisation du syst&egrave;me. L'&eacute;quipe devra aussi sp&eacute;cifier les performances requises par le
		nouveau syst&egrave;me au regard des <b>objectifs op&eacute;rationnels et financiers</b>. On doit d&eacute;finir la faisabilit&eacute; du traitement et de la maintenance, la conception du travail, les pratiques et la structure de l'organisation, la
		conception de l'interface et du poste de travail.<br>
		<br>
		Les <b>exigences organisationnelles</b> peuvent elles &ecirc;tre d&eacute;termin&eacute;es en termes de processus et flux d'&eacute;changes (exemple taux d'appel d'un centre de t&eacute;l&eacute;marketing). C'est pr&eacute;cis&eacute;ment lors de cette
		&eacute;tape que la mobilisation d'une &eacute;quipe pluridisciplinaire, aux comp&eacute;tences vari&eacute;es, est n&eacute;cessaire.<br>
		<br>
		<br>
		<h4 class="t4"><img src="../images/puce_rml.gif" align="top" border="0" alt=""> Produire des solutions de conception</h4>
		<br>
		<br>
		<br>
		<img src="../download/images/13407_etape4.png" border="0" hspace="4" alt=""> <br>
		<br>
		<br>
		L'&eacute;tape de production de solutions de conception vise &agrave; utiliser les connaissances acquises lors des &eacute;tapes pr&eacute;c&eacute;dentes pour <b>mat&eacute;rialiser les solutions</b> afin de pouvoir les modifier en fonction des
		feedback utilisateurs.<br>
		<br>
		Le choix de solutions potentielles se fait en deux grandes &eacute;tapes. L'ergonome se fonde d'abord sur son expertise et ses connaissances pour d&eacute;terminer un &eacute;ventail de choix possibles. Il teste ensuite ces options avec les utilisateurs
		pour d&eacute;finir la plus adapt&eacute;e. <br>
		<br>
		Il s'agit donc d'allouer leurs fonctions respectives &agrave; l'utilisateur et au syst&egrave;me et de faire des choix concernant la navigation, l'architecture de l'information, les styles de dialogue et le design. Selon l'ampleur du projet, on profite
		des connaissances et comp&eacute;tences des autres sp&eacute;cialistes en interface homme-machine (notamment designers et architectes de l'information). <br>
		<br>
		Plus pr&eacute;cis&eacute;ment, on peut arriver &agrave; la d&eacute;termination de gabarits pour la conception d'un guide de style, d'une charte ergonomique.<br>
		On doit aussi penser &agrave; d&eacute;velopper les outils de formation des utilisateurs et le support utilisateur en fonctions des informations acquises.<br>
		<br>
		La concr&eacute;tisation de ces solutions a plusieurs avantages. Elle permet d'abord de se faire comprendre des membres de l'&eacute;quipe et d'impl&eacute;menter des recommandations g&eacute;n&eacute;rales de fa&ccedil;on plus figurative. De plus,
		lorsque la situation dans le cycle est assez pr&eacute;coce, la concr&eacute;tisation des solutions peut se faire gr&acirc;ce &agrave; des m&eacute;thodes simples.<br>
		<br>
		On peut par exemple cr&eacute;er des maquettes statiques sur papier et mimer l'encha&icirc;nement des &eacute;crans en fonctions des r&eacute;ponses de l'utilisateur (c'est le prototypage papier). On peut aussi concevoir des storyboards puisqu'il s'agit
		de permettre &agrave; l'utilisateur de jouer des sc&eacute;narios d'utilisation en fonction des consignes. On peut construire ces prototypes plus r&eacute;alistes en html ou en utilisant des outils logiciels tels que PowerPoint ou Flash. On peut aussi
		pour certaines applications plus complexes (notamment les applications dites intelligentes) recourir &agrave; des techniques de magicien d'Oz. <br>
		<br>
		On peut donc &agrave; moindre co&ucirc;t comparer des options de conception qui semblent &eacute;quivalentes du point de vue de l'expert. Le fait que ces prototypes soient tr&egrave;s simples est un des facteurs qui permet les it&eacute;rations dans
		l'approche de conception. Ces tests des solutions tr&egrave;s t&ocirc;t dans le cycle sont essentiels pour percevoir les probl&egrave;mes d'utilisabilit&eacute; avant qu'ils ne soient trop co&ucirc;teux &agrave; r&eacute;soudre.<br>
		<br>
		<br>
		<br>
		<h4 class="t4"><img src="../images/puce_rml.gif" align="top" border="0" alt=""> Evaluer les solutions con&ccedil;ues au regard des exigences</h4>
		<br>
		<br>
		<br>
		<img src="../download/images/13407_etape5.png" border="0" hspace="4" alt=""> <br>
		<br>
		<br>
		Les prototypes cr&eacute;&eacute;s au stade pr&eacute;c&eacute;dent sont utilis&eacute;es pour &eacute;valuer les solutions con&ccedil;ues en fonction des exigences. Le pilotage de tests utilisateurs selon un protocole d'&eacute;valuation pr&eacute;cis
		permet de d&eacute;tecter facilement les d&eacute;fauts de l'interface (lire l'article <a href="recette-test-partie1.html" class="lk1">Recette de test utilisateur</a>).<br>
		<br>
		On peut <b>ordonner les d&eacute;fauts de conception selon leur importance</b> en fonctions des objectifs d'utilisabilit&eacute; d&eacute;finis pr&eacute;c&eacute;demment (<i>Est-ce qu’il n’y a pas des choses qui auront peu d’impact sur mes
		objectifs d’utilisabilit&eacute;?</i>). Au-del&agrave; des tests utilisateurs, d'autres m&eacute;thodes peuvent servir l'&eacute;valuation.<br>
		<br>
		Les focus group pour l'&eacute;valuation peuvent ainsi se d&eacute;rouler sous la forme de co-d&eacute;couverte et discussion post-test de groupe, ou de tests individuels suivis de focus sur les performances. Les Focus groups servent &agrave; choisir
		parmi des alternatives de conception. Les passations collectives ou individuelles des tests doivent &ecirc;tre choisies selon la vocation du produit (&agrave; utilisation de groupe ou individuelle).<br>
		<br>
		Pour choisir l'option de conception qui corresponde le mieux aux exigences fonctionnelles et des utilisateurs, on peut aussi proc&eacute;der &agrave; une &eacute;valuation experte sur la base des heuristiques, normes, recommandations et crit&egrave;res
		en ergonomie des interfaces. Cette inspection donne lieu &agrave; un rapport d’&eacute;valuation qui doit &ecirc;tre orient&eacute; solution. On peut imaginer d'effectuer des &eacute;valuations crois&eacute;es, mettant en commun les r&eacute;sultats
		d'inspection de plusieurs experts. Cette technique permet d'obtenir des donn&eacute;es plus fiables et compl&egrave;tes.<br>
		<br>
		Des questionnaires de satisfaction, de pr&eacute;f&eacute;rences (SUS, QUIS, PUTQ, WAMMI) peuvent &ecirc;tre propos&eacute;s aux utilisateurs. On peut ici aussi proc&eacute;der &agrave; des entretiens, observations, avec des verbalisations concomitantes
		(en m&ecirc;me temps que se d&eacute;roule l'observation) et / ou cons&eacute;cutives (suite &agrave; l'observation).<br>
		<br>
		Les techniques d'eye tracking peuvent permettre d’&eacute;valuer, de comparer diverses versions d’un m&ecirc;me produit mais doivent n&eacute;cessairement &ecirc;tre coupl&eacute;es &agrave; une connaissance approfondie des utilisateurs et des
		t&acirc;ches. De plus, le co&ucirc;t de la mise en œuvre d'une &eacute;valuation de ce type ne peut &ecirc;tre support&eacute; que pour des projets d'une ampleur importante.<br>
		<br>
		L'objectif de l'&eacute;valuation des solutions est de <b>recueillir un feedback sur la conception d&eacute;velopp&eacute;e</b>. Il permettra d'am&eacute;liorer la conception. C'est une &eacute;valuation de la satisfaction des objectifs utilisateur et
		organisationnels.<br>
		<br>
		Cette &eacute;valuation peut &ecirc;tre r&eacute;alis&eacute;e &agrave; court terme (essais par les utilisateurs pendant la conception afin de comparer des caract&eacute;ristiques des prototypes) ou &agrave; plus long terme (par exemple une &eacute;tude
		post-installation pour validation de sp&eacute;cifications, ou un questionnaire pour identifier les exigences pour la prochaine version…). Il existe toujours &agrave; l'usage des probl&egrave;mes non identifi&eacute;s lors des tests utilisateurs, que ce
		feedback pourra permettre de cerner. Une &eacute;valuation sur le terrain peut ainsi permettre de tester le fonctionnement du syst&egrave;me final.<br>
		<br>
		<br>
		<br>
		<h2 class="t2"><a name="7"></a>Conclusion</h2>
		<br>
		<br>
		Cette base normative pour le cycle de conception peut servir &agrave; la conception ou &agrave; la refonte de toute application informatique (logiciel ou application web). L'id&eacute;e est d'adapter le syst&egrave;me aux caract&eacute;ristiques des
		utilisateurs, des t&acirc;ches et du contexte.<br>
		<br>
		<br>
		On doit &ecirc;tre conscient du d&eacute;calage entre les situations de pratique et ce qu’on pourrait faire en appliquant la d&eacute;marche centr&eacute;e sur l’utilisateur du d&eacute;but &agrave; la fin. Quoiqu'il en soit, on doit insister sur la
		caract&eacute;ristique it&eacute;rative de ce cycle id&eacute;al, caract&eacute;ristique gagn&eacute;e par le feedback utilisateur et qui en fait toute sa force.<br>
		<br>
		<a name="8"></a><br>
		</td>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
	</tr>
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620" class="txt"><br>
		<br>
		<span class="t2">Pour en savoir plus...</span><br>
		<br>
		<h3 class="t3">» Ressources en ligne</h3>
		<br>
		<br>
		<a href="http://www.stakes.fi/INCLUDE/1-0.htm" class="lk1" target="_blank">User Centred Design Methodology and Tools</a>, Include (INCLUsion of Disabled and Elderly people in telematics).<br>
		(http://www.stakes.fi/INCLUDE/1-0.htm)<br>
		<br>
		<a href="http://www.ejeisa.com/nectar/inuse/6.2/contents.htm" class="lk1" target="_blank">Handbook of User-Centred Design</a> (6.2 ), INUSE (projet europ&eacute;en Nectar).<br>
		(http://www.ejeisa.com/nectar/inuse/6.2/contents.htm)<br>
		<br>
		<a href="http://www.usability.serco.com/trump/index.htm" class="lk1" target="_blank">Cost effective User Centred Design</a>, TRUMP.<br>
		(http://www.usability.serco.com/trump/index.htm)<br>
		<br>
		<a href="http://www-3.ibm.com/ibm/easy/eou_ext.nsf/publish/570" class="lk1" target="_blank">User-Centered Design</a>, rubrique de la section Ease of Use d'IBM.<br>
		(http://www-3.ibm.com/ibm/easy/eou_ext.nsf/publish/570)<br>
		<br>
		<a href="http://www.ucc.ie/hfrg/emmus/methods/iso.html" class="lk1" target="_blank">Introduction to ISO 13 407</a>, EMMUS (European MultiMedia Usability Services).<br>
		(http://www.ucc.ie/hfrg/emmus/methods/iso.html)<br>
		<br>
		<br>
		<h3 class="t3">» Ressources externes</h3>
		<br>
		<br>
		ISO/TR 16982:2002 - Ergonomie de l'interaction homme-syst&egrave;me - M&eacute;thodes d'utilisabilit&eacute; pour la conception centr&eacute;e sur l'op&eacute;rateur humain.<br>
		<br>
		ISO/TR 18529:2000 - Ergonomie de l'interaction homme/syst&egrave;me - Descriptions des processus cycle de vie centr&eacute;es sur l'op&eacute;rateur humain.<br>
		<br>
		ISO 13407:1999 - Processus de conception centr&eacute;e sur l'op&eacute;rateur humain pour les syst&egrave;mes interactifs.<br>
		<br>
		Vredenburg, K., Isensee, S. &amp; Righi, C. (2001). <i>User-Centered Design: An Integrated Approach</i>, Prentice Hall.<br>
		<br>
		Mayhew, D. (1999). <i>The Usability Engineering Lifecycle: A Practitioner's Handbook for User Interface Design</i>, Morgan Kaufmann.<br>
		<br>
		<br>
		</td>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
	</tr>
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620"><img src="../images/pt.gif" width="620" height="1" border="0" alt=""></td>
		<td valign="top" width="30"><img src="../images/pt.gif" width="30" height="1" border="0" alt=""></td>
	</tr>
</table>
</body>
</html>
