<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta name="description"
	content="ergolab, ressources ergonomie web et logiciel">
<meta name="keywords"
	content="ergolab, ressources ergonomie web et logiciel, utilisabilité">
<title>Ergolab - Ergonomie informatique : les principales
m&eacute;thodes . version imprimable</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<script language="javascript" type="text/javascript">
<!--
//CSS
if(-1 != navigator.userAgent.indexOf("MSIE"))
{document.write('<link rel="stylesheet" type="text/css" href="../styles/ie.css">');}
else if (-1 != navigator.userAgent.indexOf("Mozilla"))
{document.write('<link rel="stylesheet" type="text/css" href="../styles/ns.css">');}
else
{document.write('<link rel="stylesheet" type="text/css" href="../styles/ie.css">');}
// -->
</script>
</head>
<body style="background-color: \#FFFFFF;" bgcolor="#FFFFFF"
	leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<table width="680" border="0" cellspacing="0" cellpadding="0"
	bgcolor="#FFFFFF">
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620" class="txt"><br>
		<h1 class="t1">Ergonomie informatique : les principales
		m&eacute;thodes</h1>
		<br>
		<span class="txtgris">(date de r&eacute;daction : 19.09.2004)</span><br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<b>Sommaire</b><br>
		<br>
		&nbsp;&nbsp;&nbsp;<a href="#1" class="lka">Introduction</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#2" class="lka">1.
		D&eacute;terminants des choix m&eacute;thodologiques</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#3" class="lka">2.
		Analyse de la demande</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#4" class="lka">3.
		Analyse de l'activit&eacute;</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#5" class="lka">4.
		Inspection</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#6" class="lka">5.
		Analyse concurrentielle</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#7" class="lka">6.
		Tri de cartes</a><br>
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href="#8" class="lka">7.
		Test utilisateur</a><br>
		&nbsp;&nbsp;&nbsp;<a href="#9" class="lka">Conclusion</a><br>
		&nbsp;&nbsp;&nbsp;<a href="#10" class="lka">Pour en savoir plus...</a><br>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<br>
		<a name="1"></a>
		<h2 class="t2">Introduction</h2>
		<br>
		<br>
		Cet article pr&eacute;sente les principales m&eacute;thodes
		utilis&eacute;es en ergonomie informatique. Cette s&eacute;lection
		permet d'avoir une vue d'ensemble du travail de l'ergonome et des
		outils auxquels il recourt. <br>
		<br>
		Nous n'&eacute;voquerons donc pas toutes les m&eacute;thodes, mais
		uniquement les plus courantes. De plus, cette liste ne d&eacute;taille
		que des m&eacute;thodes &quot;finales&quot;, et non pas les techniques
		qui servent &agrave; les mettre en oeuvre (par exemple, la technique
		de l'interview, qui entre en jeu dans la m&eacute;thode d'analyse de
		l'activit&eacute;). Les exemples et orientations donn&eacute;s sont
		principalement issus du web.<br>
		<br>
		<br>
		<br>
		<a name="2"></a>
		<h2 class="t2">1. D&eacute;terminants des choix
		m&eacute;thodologiques</h2>
		<br>
		<br>
		Dans un monde id&eacute;al, on pourrait imaginer pour chaque projet
		&quot;la&quot; d&eacute;marche optimale, permettant d'obtenir des
		r&eacute;sultats que l'on estime satisfaisants. Cependant, cet
		id&eacute;al est rarement applicable dans la r&eacute;alit&eacute;.<br>
		<br>
		En effet, cette r&eacute;alit&eacute; nous impose des restrictions
		temporelles, technologiques et financi&egrave;res. L'enjeu est donc de
		parvenir &agrave; d&eacute;finir la d&eacute;marche
		m&eacute;thodologique correspondant le mieux au type de projet.<br>
		<br>
		On doit donc se poser des questions cl&eacute;s concernant le projet
		et le type d'interface. R&eacute;pondre &agrave; ce type de questions
		pourra permettre d'effectuer des choix m&eacute;thodologiques
		pertinents. Les th&egrave;mes &agrave; &eacute;voquer sont les
		suivants :<br>
		<br>
		» De quel type d'interface s'agit-il ? (site web, application en
		ligne, logiciel, interface homme-machine sur automate...)<br>
		<br>
		» Parle-t-on de conception pure ou de refonte d'une interface
		existante?<br>
		<br>
		» S'il s'agit de la refonte d'une interface existante, quelles
		donn&eacute;es a-t-on sur les patterns d'utilisation de l'application,
		et existe-t-il des utilisateurs experts que l'on puisse contacter?<br>
		<br>
		» Existe-t-il des interfaces comparables dans le domaine
		concurrentiel?<br>
		<br>
		» Quelle part du budget est consacr&eacute;e &agrave; l'ergonomie,
		cette part est-elle n&eacute;gociable? (le facteur financier est
		souvent pr&eacute;pond&eacute;rant dans les choix
		m&eacute;thodologiques)<br>
		<br>
		» Quels sont les imp&eacute;ratifs temporels?<br>
		<br>
		» Quels sont les moyens technologiques dont on dispose pour effectuer
		des tests utilisateurs? (enregistrements des &eacute;v&eacute;nements
		&agrave; l'&eacute;cran, miroir sans tain, enregistrement du visage de
		l'utilisateur, enregistrement audio, eye-tracking…)<br>
		<br>
		» Quels sont les moyens humains dont on dispose pour effectuer des
		tests utilisateurs? Cette question peut se scinder en deux
		probl&eacute;matiques:<br>
		- Les participants au test, avec sous-jacente, la question de la cible
		(existe-t-il des utilisateurs r&eacute;els en cas de refonte,
		s'agit-il d'une cible professionnelle ou grand public, quelles sont
		ses caract&eacute;ristiques, est-elle accessible facilement…)<br>
		- Les responsables du test : quelles personnes de l'&eacute;quipe
		peuvent encadrer le test, peut-on se permettre de faire intervenir
		deux personnes de fa&ccedil;on permanente pour chacune des sessions de
		test…<br>
		<br>
		Les questions pr&eacute;c&eacute;dentes permettent de r&eacute;pondre
		&agrave; une probl&eacute;matique centrale :
		<h4 class="t4">parmi les m&eacute;thodes existantes, quelles
		m&eacute;thodes ai-je r&eacute;ellement &agrave; ma disposition?</h4>
		(Ce panel &eacute;tant d&eacute;fini par mes comp&eacute;tences, les
		moyens techniques, financiers et humains du projet).<br>
		<br>
		<br>
		<br>
		<a name="3"></a>
		<h2 class="t2">2. Analyse de la demande</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/2.gif" border="0" hspace="4" alt="Analyse de la demande: Comprendre le contexte dans lequel on intervient pour y associer une intervention adéquate.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		L'analyse de la demande est souvent consid&eacute;r&eacute;e comme le
		pilier de l'intervention ergonomique. Cette analyse de la demande
		d&eacute;termine les choix m&eacute;thodologiques que nous
		&eacute;voquions pr&eacute;c&eacute;demment. <br>
		<br>
		En premier lieu, il s'agit de comprendre les objectifs du client (qui
		peuvent &ecirc;tre du type &quot;je veux un site web&quot;), et de les
		reformuler afin de supporter l'intervention. Selon les
		caract&eacute;ristiques de la demande, il s'agit soit de guider le
		client vers la d&eacute;marche la plus adapt&eacute;e, soit d'analyser
		sa vision de l'intervention et d'en discuter avec lui. <br>
		<br>
		On doit savoir pourquoi l’entreprise demande la conception d'une
		application informatique. Quels sont les besoins qui motivent cette
		demande? S'il s’agit-il d’une refonte de l'interface ou d’une partie
		de l'interface, pourquoi le client souhaite-t-il y proc&eacute;der?
		Existe-t-il des retours des utilisateurs finaux? Quels sont les
		objectifs de l'application en question? etc.<br>
		<br>
		Un point essentiel de l'analyse de la demande consiste &agrave;
		identifier la cible utilisateur ainsi que ses caract&eacute;ristiques:
		&agrave; qui le site s'adresse-t-il? La d&eacute;finition de cette
		cible d&eacute;terminera les choix m&eacute;thodologiques mais aussi
		la teneur des recommandations, la vision que l'ergonome pourra avoir
		de l'interface et des points critiques &agrave; prendre en compte.<br>
		<br>
		L'analyse de la demande est l'&eacute;tape premi&egrave;re de toute
		intervention ergonomique. Cependant, tout au long d'un projet on est
		amen&eacute; &agrave; recadrer les objectifs, &agrave; recentrer les
		probl&eacute;matiques, et cela participe encore de l'analyse de la
		demande, ou plut&ocirc;t de la gestion de cette demande.<br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode d'analyse de la
		demande</h4>
		<br>
		<br>
		<b>Avantages</b>:<br>
		- Une &eacute;tape indispensable, permettant l'int&eacute;gration de
		l'ergonomie au d&eacute;but du projet<br>
		- Une composante de gestion de projet qui permet de comprendre le
		contexte de l'intervention<br>
		<br>
		<b>Inconv&eacute;nients</b>:<br>
		- Une n&eacute;cessaire interaction avec le client, qui peut
		&ecirc;tre difficile &agrave; g&eacute;rer selon sa
		compr&eacute;hension des probl&eacute;matiques ergonomiques et plus
		largement selon sa connaissance du web<br>
		<br>
		<br>
		<br>
		<a name="4"></a>
		<h2 class="t2">3. Analyse de l'activit&eacute;</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/3.gif" border="0" hspace="4" alt="Analyse de l'activité: Comprendre les composantes de l'activité pour y faire correspondre les choix d'interface.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		L'analyse de l'activit&eacute; est la base du travail de l'ergonome.
		Support&eacute;e par des techniques d'observation et d'entretien, elle
		permet de concevoir une interface homme-machine adapt&eacute;e aux
		besoins de l'utilisateur. Il s'agit de d&eacute;composer
		l'activit&eacute; de l'utilisateur qui tente d'atteindre un objectif
		donn&eacute;. <br>
		<br>
		Cette &eacute;tude est diff&eacute;rente selon que l'activit&eacute;
		existe d&eacute;j&agrave; (support&eacute;e ou non par une interface
		informatique), ou qu'elle soit uniquement projet&eacute;e dans le
		futur. Pour des projets de refonte, le recueil des donn&eacute;es peut
		b&eacute;n&eacute;ficier d'une analyse des usages des outils
		existants. L'analyse des t&acirc;ches utilisateur permet de comprendre
		comment les utilisateurs vont utiliser le syst&egrave;me, quelles sont
		les t&acirc;ches critiques, les plus fr&eacute;quentes, leurs
		importances, dur&eacute;es et niveau de difficult&eacute; respectifs.<br>
		<br>
		Dans tous les cas, on devra identifier les buts et t&acirc;ches des
		utilisateurs. L'id&eacute;e consiste ensuite &agrave; cerner les
		proc&eacute;dures, op&eacute;rations mentales, informations requises
		et produites pour atteindre l'objectif d&eacute;crit par la
		t&acirc;che. On essaie de d&eacute;terminer le d&eacute;roulement pas
		&agrave; pas de la compl&eacute;tion des t&acirc;ches et les
		interd&eacute;pendances entre ces &eacute;tapes. <br>
		<br>
		Les connaissances extraites lors de l'analyse de t&acirc;che
		permettront de d&eacute;gager des mod&egrave;les de t&acirc;che. Ces
		mod&egrave;les doivent d&eacute;crire de fa&ccedil;on temporelle et
		hi&eacute;rarchique les activit&eacute;s n&eacute;cessaires pour
		atteindre un objectif. La mod&eacute;lisation de ces activit&eacute;s
		et des flux d'information dans le syst&egrave;me permettra de
		structurer le dialogue homme-machine &agrave; concevoir. <br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode d'analyse de
		l'activit&eacute;</h4>
		<br>
		<br>
		<b>Avantages</b>:<br>
		- Une m&eacute;thode cl&eacute; permettant de prendre en compte les
		activit&eacute;s r&eacute;elles des utilisateurs<br>
		- Permet un travail de profondeur, qui ne concerne pas seulement les
		aspects de surface d'une interface<br>
		<br>
		<b>Inconv&eacute;nients</b>:<br>
		- La mise en oeuvre d'une analyse de l'activit&eacute; est longue<br>
		- Doit n&eacute;cessairement &ecirc;tre conduite par un expert<br>
		<br>
		<br>
		<br>
		<a name="5"></a>
		<h2 class="t2">4. Inspection</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/4.gif" border="0" hspace="4" alt="Inspection: Comparer une interface existante aux normes d'ergonomie et d'utilisabilité.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		Pour les projets de refonte d'interfaces, une inspection de l'existant
		permet de cerner les probl&egrave;mes d'ergonomie et d'architecture de
		l'information. Elle peut questionner l'utilit&eacute; de l'application
		ou de certaines de ses fonctionnalit&eacute;s. <br>
		<br>
		L'inspection est une m&eacute;thode qui se base sur la comparaison de
		l'application aux connaissances ergonomiques sur l'optimisation des
		interfaces homme-machine. Cette &eacute;valuation est classiquement
		bas&eacute;e sur l'utilisation de normes, recommandations, guides de
		styles, revues de questions, travaux d'experts.<br>
		<br>
		Il s'agit non seulement d'&eacute;valuer les aspects de surface, mais
		aussi d'analyser la r&eacute;partition fonctionnelle des
		&eacute;l&eacute;ments, l'architecture d'information du
		syst&egrave;me, son accessibilit&eacute;, les styles d'interaction et
		l'utilit&eacute; g&eacute;n&eacute;rale ou sp&eacute;cifique de
		l'application. <br>
		<br>
		Cette inspection peut &ecirc;tre conduite de fa&ccedil;on
		crois&eacute;e : on peut faire intervenir plusieurs ergonomes,
		inspectant chacun l'interface sur la base de la m&ecirc;me grille. Les
		&eacute;valuations sont ensuite mises en commun, discut&eacute;es, et
		donnent lieu &agrave; l'attribution de niveaux de priorit&eacute; pour
		chacun des points abord&eacute;s.<br>
		<br>
		L'inspection peut n&eacute;cessiter le recours &agrave; des outils
		sp&eacute;cifiques, notamment pour &eacute;valuer
		l'accessibilit&eacute; de l'interface existante (accessibilit&eacute;
		technologique ou accessibilit&eacute; visuelle). On utilise donc un
		panel de plate-formes diversifi&eacute;, des aides technologiques
		(synth&egrave;ses vocales, navigateur texte permettant la
		retranscription &agrave; une plage braille) et les outils de
		validation du W3C.<br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode d'inspection</h4>
		<br>
		<br>
		<b>Avantages</b>:<br>
		- Un principe simple<br>
		- Economique<br>
		- Peut-&ecirc;tre rapide selon le degr&eacute; de profondeur de
		l'inspection<br>
		<br>
		<b>Inconv&eacute;nients</b>:<br>
		- Demande une certaine exp&eacute;rience <br>
		- Demande une analyse fine, compl&egrave;te et parfois
		r&eacute;p&eacute;titive de l'interface (il s'agit de tester tous les
		patterns d'interaction possibles)<br>
		- Demande d'&ecirc;tre contextualis&eacute; et de prendre en compte
		des facteurs internes au projet<br>
		- Fait appel &agrave; la subjectivit&eacute; de l'expert <br>
		- Ne fait pas appel aux utilisateurs finaux<br>
		<br>
		<br>
		<br>
		<a name="6"></a>
		<h2 class="t2">5. Analyse concurrentielle</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/5.gif" border="0" hspace="4" alt="Analyse concurrentielle: Etudier les applications concurrentes, à un niveau global ou pour une fonctionnalité spécifique.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		L'analyse concurrentielle consiste &agrave; &eacute;tudier les
		applications des concurrents. Un concurrent n'est pas forc&eacute;ment
		un concurrent au niveau commercial, mais une interface
		pr&eacute;sentant des fonctionnalit&eacute;s / pages semblables
		&agrave; l'application que l'on envisage de construire. Deux types
		d'analyses peuvent &ecirc;tre conduites:<br>
		<br>
		- Analyses concurrentielles g&eacute;n&eacute;rales. On &eacute;tudie
		dans ce cas des probl&eacute;matiques strat&eacute;giques, les
		fonctionnalit&eacute;s offertes par l'application, les choix de
		structures, d'architecture de l'information et de moyens de
		navigation.<br>
		<br>
		- Analyses concurrentielles pr&eacute;cises. On &eacute;tudie dans ce
		cas une fonctionnalit&eacute; sp&eacute;cifique ou un
		&eacute;l&eacute;ment d'interface d&eacute;fini (exemple: une
		proc&eacute;dure de commande en ligne).<br>
		<br>
		Cette m&eacute;thode permet de conna&icirc;tre l'existant, de se baser
		sur ces &eacute;l&eacute;ments ou d'en extraire des principes
		n&eacute;gatifs ou positifs. Les enjeux de la m&eacute;thode sont les
		suivants :<br>
		<br>
		» <b>Comprendre le contexte concurrentiel dans lequel le projet
		s'inscrit</b>:<br>
		<br>
		- Qui sont les concurrents sur le march&eacute;?<br>
		- Quelles sont les terminologies utilis&eacute;es?<br>
		- Quels sont les services propos&eacute;s?<br>
		- Quelles sont les fonctionnalit&eacute;s disponibles?<br>
		- Quelles sont les sp&eacute;cificit&eacute;s techniques des
		applications concurrentes? (communication entre modules,
		portabilit&eacute;, &eacute;volutivit&eacute;, flexibilit&eacute;…)<br>
		<br>
		» <b>Cerner les standards existants pour des
		&eacute;l&eacute;ments d'interface pr&eacute;cis</b>:<br>
		<br>
		Dans le domaine du web grand public, cette notion de standard est
		primordiale et on ne peut s'en passer. Elle est presque comparable aux
		connaissances de psychologie sur notre fonctionnement cognitif
		(m&eacute;moire, perception…), en ce qu'elle sous-tend les
		raisonnements et comportements des utilisateurs.<br>
		<br>
		Il est souvent pr&eacute;f&eacute;rable de recourir &agrave; un
		standard plut&ocirc;t que d'impl&eacute;menter une solution qui
		para&icirc;t meilleure du point de vue de l'utilisabilit&eacute; du
		syst&egrave;me. En effet, le b&eacute;n&eacute;fice qu'elle apporte
		n'est sans doute pas comparable &agrave; celui fourni par
		l'utilisation de standards. Le recours &agrave; ces sortes de normes
		permet de capitaliser sur les connaissances des utilisateurs
		concernant le comportement des pages web. On &eacute;vite ainsi que
		chaque nouveau site soit une totale d&eacute;couverte.<br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode d'analyse
		concurrentielle</h4>
		<br>
		<br>
		<b>Avantages</b><br>
		- Economique<br>
		- Permet d'int&eacute;grer les conventions web &agrave; la conception<br>
		- Reproduit les b&eacute;n&eacute;fices d'un brainstorming<br>
		- Permet de glisser vers d'autres domaines que l'ergonomie pure,
		notamment lorsque l'on questionne l'utilit&eacute; des services
		propos&eacute;s, les cibles vis&eacute;es, le ton employ&eacute;, etc.
		Entrent alors en ligne de compte des notions de strat&eacute;gie et de
		marketing, qui gagnent &agrave; &ecirc;tre &eacute;tudi&eacute;es en
		compl&eacute;ment de l'utilisabilit&eacute;.<br>
		<br>
		<b>Inconv&eacute;nients</b><br>
		- Pas d'intervention des utilisateurs r&eacute;els ou potentiellements
		r&eacute;els<br>
		- Les r&eacute;sultats ne sont pas bas&eacute;s sur une r&eacute;elle
		&eacute;tude d'ergonomie<br>
		- On suppose que les concurrents ont un produit qualitatif<br>
		<br>
		<br>
		<br>
		<a name="7"></a>
		<h2 class="t2">6.Tri de cartes</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/1.gif" border="0" hspace="4" alt="Tri de cartes: Organiser les informations pour que la navigation devienne intuitive.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		Le tri de cartes (card sorting) est une m&eacute;thode d'organisation
		des contenus, tr&egrave;s utilis&eacute;e dans le domaine du web. Elle
		permet de d&eacute;finir des rubriques de site correspondant aux
		repr&eacute;sentations mentales des utilisateurs finaux.<br>
		<br>
		Le tri de cartes consiste &agrave; pr&eacute;senter &agrave;
		l'utilisateur un paquet de &quot;cartes&quot;, correspondant aux
		contenus &agrave; rubriquer, et &agrave; lui demander de faire des
		groupes de cartes puis de les nommer. Les r&eacute;sultats d'un tri de
		cartes sont des sources d'informations tr&egrave;s riches pour
		construire un rubriquage pertinent. <br>
		<br>
		Pour en savoir plus sur la m&eacute;thode du tri de cartes, vous
		pouvez consulter notre article <a
			href="http://ergolab.net/articles/tri-de-cartes-ergonomie-web.html"
			class="lk1">Tri de cartes et ergonomie web</a>.<br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode du tri de cartes</h4>
		<br>
		<br>
		<b>Avantages</b><br>
		- Economique <br>
		- Rapide<br>
		- Fournit des informations fondamentales pour construire un rubriquage
		et un vocabulaire d'interface orient&eacute;s utilisateur final<br>
		- Peut s'int&eacute;grer dans le processus de gestion de projet : le
		tri de cartes peut &ecirc;tre un support de d&eacute;finition des
		besoins et d'une analyse de la demande en profondeur avec le client<br>
		- Permet de cerner la complexit&eacute; d'un m&eacute;tier par
		l'appr&eacute;hension de processus et de classes d'objets de travail <br>
		<br>
		<b>Inconv&eacute;nients</b><br>
		- Recueil de cat&eacute;gories mentales propres &agrave; chaque
		utilisateur <br>
		- Recueil d'avis subjectifs<br>
		- Travailler avec un seul utilisateur ou le client ne permet pas de
		rep&eacute;rer de clusters mais uniquement la repr&eacute;sentation
		mentale qu'il se fait de l'organisation et de l'interaction entre les
		contenus<br>
		<br>
		<br>
		<br>
		<a name="8"></a>
		<h2 class="t2">7. Test utilisateur</h2>
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		<img src="../download/images/6.gif" border="0" hspace="4" alt="Test utilisateur: Conduire des tests avec des utilisateurs réels, analyser et enregistrer leur interaction avec l'application.">
		<br>
		<br>
		<img src="../images/pointilles2.gif" align="middle" border="0" alt=""><br>
		<br>
		La proc&eacute;dure g&eacute;n&eacute;rale d'un test consiste &agrave;
		pr&eacute;parer le test utilisateur, &agrave; le conduire, puis
		&agrave; analyser les r&eacute;sultats. Ces 3 grandes &eacute;tapes
		peuvent &ecirc;tre d&eacute;compos&eacute;es en la liste
		d'activit&eacute;s suivantes:<br>
		<br>
		- Identifier la cible utilisateur et ses caract&eacute;ristiques<br>
		- Identifier les objectifs des utilisateurs<br>
		- Recruter et prendre rendez-vous avec les utilisateurs<br>
		- Pr&eacute;parer le plan de test en fonction des objectifs
		d’utilisabilit&eacute;<br>
		- Pr&eacute;parer pr&eacute; et post questionnaires<br>
		- D&eacute;velopper le mat&eacute;riel de test<br>
		- Pr&eacute;-tester avec un ou deux utilisateurs<br>
		- Conduire les tests<br>
		- Analyser les r&eacute;sultats<br>
		<br>
		Si vous voulez en savoir plus sur la m&eacute;thode des tests
		utilisateurs, chacune de ces &eacute;tapes de la proc&eacute;dure est
		d&eacute;velopp&eacute;e dans notre article <a
			href="http://ergolab.net/articles/recette-test-partie1.html"
			class="lk1">Recette de test utilisateur</a>.<br>
		<br>
		<br>
		<img src="../images/puce_rml.gif" align="top" border="0" alt="">
		<h4 class="t4">Evaluation de la m&eacute;thode du test
		utilisateur</h4>
		<br>
		<br>
		<b>Avantages</b><br>
		- Des donn&eacute;es fournies par les utilisateurs finaux ou leurs
		repr&eacute;sentants<br>
		- Une m&eacute;thode qui permet de recueillir plusieurs types de
		donn&eacute;es, et d'analyser l'interface sous plusieurs angles<br>
		- Le travail sur des maquettes ou des prototypes permet de se
		confronter de fa&ccedil;on r&eacute;p&eacute;t&eacute;e &agrave;
		l'interface que l'on a sp&eacute;cifi&eacute;e, et de d&eacute;celer
		ainsi des points potentiellement probl&eacute;matiques.<br>
		<br>
		<b>Inconv&eacute;nients</b> <br>
		- Un investissement temporel et financier &eacute;lev&eacute;
		(pr&eacute;paration, passations et analyse des donn&eacute;es /
		intervention de l'ergonome et r&eacute;mun&eacute;ration des
		participants). Le choix de cette m&eacute;thode suppose que le projet
		soit d'ampleur suffisante pour l'avoir fait pr&eacute;c&eacute;der
		d'analyses moins approfondies.<br>
		<br>
		<br>
		<br>
		<a name="9"></a>
		<h2 class="t2">Conclusion</h2>
		<br>
		<br>
		Les m&eacute;thodes pr&eacute;sent&eacute;es dans cet article sont
		celles qui sont utilis&eacute;es couramment en ergonomie informatique.
		Le choix de recourir &agrave; l'une ou l'autre de ces m&eacute;thodes
		r&eacute;sulte du croisement entre les comp&eacute;tences du
		concepteur, les moyens techniques, financiers et humains dont il
		dispose, et les caract&eacute;ristiques de l'interface et de son
		public cible.<br>
		<br>
		La mise en oeuvre de ces m&eacute;thodes permet de prendre des
		d&eacute;cisions concernant la structure et la pr&eacute;sentation
		d'une application.<br>
		<br>
		Ces d&eacute;cisions seront ensuites concr&eacute;tis&eacute;es par la
		r&eacute;daction de recommandations, sp&eacute;cifications, chartes
		ergonomiques, architectures de syst&egrave;mes, maquettes et
		prototypes. Ces activit&eacute;s de formalisation, qui viennent
		apr&egrave;s la mise en oeuvre de m&eacute;thodes ergonomiques
		&agrave; proprement parler, sont celles qui permettront de communiquer
		avec le reste de l'&eacute;quipe sur les probl&eacute;matiques
		d'ergonomie.<br>
		<a name="10"></a><br>
		</td>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
	</tr>
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620" class="txt"><br>
		<br>
		<span class="t2">Pour en savoir plus...</span><br>
		<br>
		<a href="http://www.usabilis.com/methode/ergonomie.htm" class="lk1"
			target="_blank">Les m&eacute;thodes en ergonomie informatique</a> sur
		Usabilis.<br>
		(http://www.usabilis.com/methode/ergonomie.htm)<br>
		<br>
		<a href="http://www.userdesign.com/usability_uem.html" class="lk1"
			target="_blank">Comparaison des m&eacute;thodes
		d'&eacute;valuation</a> sur Userdesign.<br>
		(http://www.userdesign.com/usability_uem.html)<br>
		<br>
		<a href="http://hcibib.org/tcuid/chap-4.html" class="lk1"
			target="_blank">Informations sur les tests utilisateurs et
		l'inspection</a>, <i>Task-Centered User Interface Design - A Practical
		Introduction</i> (consulter les chapitres User testing et Inspections),
		Clayton Lewis &amp; John Rieman, 1993.<br>
		(http://hcibib.org/tcuid/chap-4.html)<br>
		<br>
		<a href="http://jthom.best.vwh.net/usability/" class="lk1"
			target="_blank">The Usability Methods Toolbox</a>, James Hom.<br>
		(http://jthom.best.vwh.net/usability/)<br>
		<br>
		<a href="http://www.usabilitynet.org/tools/methods.htm" class="lk1"
			target="_blank">Pr&eacute;sentation des m&eacute;thodes pour
		l'utilisabilit&eacute;</a> sur UsabilityNet, avec un tri en fonction de
		l'expertise de l'intervenant, de l'intervention d'utilisateurs finaux
		ou pas, et du temps / des ressources disponibles.<br>
		(http://www.usabilitynet.org/tools/methods.htm)<br>
		<br>
		<a
			href="http://www.useit.com/papers/heuristic/heuristic_evaluation.html"
			class="lk1" target="_blank">How to Conduct a Heuristic Evaluation</a>,
		Jakob Nielsen.<br>
		(http://www.useit.com/papers/heuristic/heuristic_evaluation.html)<br>
		</td>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
	</tr>
	<tr>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
		<td valign="top" width="620"><img src="../images/pt.gif"
			width="620" height="1" border="0" alt=""></td>
		<td valign="top" width="30"><img src="../images/pt.gif"
			width="30" height="1" border="0" alt=""></td>
	</tr>
</table>
<script type="text/javascript"></script>
</body>
</html>
