<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Document sans nom</title>
</head>
<body>
Bonjour,<br />
<br />
Le 28 f&eacute;vr. 05, &agrave; 13:49, Amanda Bouffier a &eacute;crit :<br />
<br />
<blockquote>Bonjour,<br />
	<br />
	J'aimerais avoir des avis sur les diff&eacute;rences entre les mod&egrave;les
	de t&acirc;ches utilis&eacute;s en ing&eacute;ni&eacute;rie logicielle (type
	sc&eacute;narios en UML) et les mod&egrave;les de t&acirc;ches (type MAD) utilis&eacute;s
	en ergonomie. <br />
</blockquote>
<br />
Le sujet est vaste et il y aurait beaucoup &agrave; dire... Voici un d&eacute;but
de r&eacute;ponse :<br />
La grosse diff&eacute;rence &agrave; mon sens entre les mod&egrave;les de t&acirc;ches
utilis&eacute;s en ing&eacute;nierie logicielle et en ergonomie porte essentiellement
sur ce que l'on d&eacute;sire mod&eacute;liser. En effet, si en ing&eacute;nierie
logicielle on d&eacute;sire mod&eacute;liser l'interaction entre un utilisateur
et un logiciel pour r&eacute;aliser une t&acirc;che pr&eacute;cise, en ergonomie
la mod&eacute;lisation de la t&acirc;che &agrave; pour vocation de mod&eacute;liser
la fa&ccedil;on dont un futur utilisateur r&eacute;alise une certaine t&acirc;che
que ce soit en interaction avec un syst&egrave;me ou non. <br />
Voici une petite d&eacute;finition de la mod&eacute;lisation de la t&acirc;che
telle qu'on l'entend en ergonomie: <br />
L&rsquo;analyse de t&acirc;che est le processus d&rsquo;analyse de la fa&ccedil;on
dont les gens r&eacute;alisent leur travail&nbsp;: les choses qu&rsquo;ils font
et pourquoi, les choses sur lesquelles ils agissent et les choses qu&rsquo;ils
ont besoin de savoir. <br />
L&rsquo;analyse de la t&acirc;che doit &ecirc;tre associ&eacute;e &agrave; une
analyse du contexte dans lequel les t&acirc;ches sont r&eacute;alis&eacute;es.
Il est donc important de mener celle-ci sur le terrain avec les utilisateurs. <br />
Les diff&eacute;rentes t&acirc;ches que l'on analyse ne concerne pas forc&eacute;ment
une interaction avec un une interface informatis&eacute;e et cela peut constituer
une des raisons pour lesquelles on entreprend une analyse globale de la t&acirc;cher:
d&eacute;finir sur quelle(s) t&acirc;che(s) une aide logicielle peut &ecirc;tre
envisager.<br />
<br />
<blockquote>Sur quels points pr&eacute;cis et concrets les mod&egrave;les en
	ILOG ne sont plus adapt&eacute;s et manque en expressivit&eacute; si on veut
	entreprendre une conception centr&eacute;e utilisateur?<br />
</blockquote>
<br />
D&eacute;but de r&eacute;ponse apport&eacute;e plus haut... Tu ne mod&eacute;lises
pas les m&ecirc;mes choses et UML n'a pas &eacute;t&eacute; con&ccedil;u dans
le but de r&eacute;aliser une analyse de la t&acirc;che (au sens o&ugrave; on
l'entend en ergonomie :-) ), mais pour mod&eacute;liser un syst&egrave;me informatis&eacute; avec
une notation proche des langages objets. Pour des points pr&eacute;cis et concret
je te conseille un peu de lecture :<br />
<br />
Livres :<br />
Dix A., Finlay J., Abowd G., &amp; Beale R., Human-Computer Interaction &ndash; Second
Edition. Cambrigde, U.K.&nbsp;: Prentice Hall, 1998. <br />
A. Bisseret, S. S&eacute;billotte, P. Falzon, Techniques pratiques pour l&rsquo;&eacute;tude
des activit&eacute;s expertes, &eacute;dition Octares, 1999.<br />
JoAnn T. Hackos &amp; Janice C. Redish, User and Task Analysis for Interface
Design, &eacute;dition Wiley, 1998.<br />
<br />
Th&egrave;se :<br />
F. Jambon, Erreurs et interruptions du point de vue de l&rsquo;ing&eacute;nierie
de l&rsquo;Interaction Homme-Machine <br />
qui doit &ecirc;tre t&eacute;l&eacute;chargeable quelque part sur internet, g
plus l'adresse exacte ... :-( <br />
<br />
Utilisation des sp&eacute;cifications formelles dans le processus de conception
des Interfaces Homme-Machine (P. Brun, F. Jambon), 1997. <br />
T&eacute;l&eacute;chargeable &agrave; l&rsquo;adresse&nbsp;: http://iihm.imag.fr/publs/1997/IHM97_Formalismes.Fr.pdf<br />
<br />
<blockquote>Merci pour vos r&eacute;ponses!<br />
	Amanda Bouffier<br />
</blockquote>
<br />
De rien :-D<br />
Beno&icirc;t Giovangrandi &lt;benoit.gio@laposte.net&gt; 
</body>
</html>
